Revit 2027 API
InternalDefinition.BuiltInParameter Property
 Tests whether this definition identifies a built-in parameter or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BuiltInParameter BuiltInParameter { get; }
Public ReadOnly Property BuiltInParameter As BuiltInParameter
	Get
public:
property BuiltInParameter BuiltInParameter {
	BuiltInParameter get ();
}
member BuiltInParameter : BuiltInParameter with get
Property Value
BuiltInParameter
Remarks
 For a build-in parameter this property equals one of the BuiltInParameter enumerated values. For custom-defined parameters, such as shared, global, or family parameters the value is always BuiltInParameter.INVALID.
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace